diary/als-about.org
【关于】-阿亮的空间说明文档
*** INFO
日期: 2016-07-09;作者: 阿亮;关键字:网站说明、事件记录、博文目录说明

链接:[[als-about.html][说明文档]]
* 网站说明
不想拖延，不想因为想的太多而做的太少而痛苦，一直觉得大多时候忙碌的时候总是让心变简单。
刚刚完成了网站我希望达到的最基本的功能，写个说明文档。开个头，后面不断的补充。
** 【初衷】
现在2016-07-09，外面夜很宁静，喜欢这种大城市喧嚣背后这种寂静的心境。
大三结束了，接下来60多天的暑假，然后准备校园招聘会。之前一直忙于2014年11月大二上开始的实习，
做着实习单位所谓的大学生软件服务外包的项目，都是项目需要什么学习什么，学校课上安排什么学习什么。

2016年06月27日，正式从待了21个月的实习单位离职。暑假两个月，打算系统的梳理复习一下大学期间打算学到的知识，
最初在CSDN上花一天折腾了一个博客，打算记录学习的知识。后面想着自己还要准备个简历，我觉得青春充满无限幻想，
喜欢折腾，相信明天会更好。结合博客和简历两个需求，便产生了现在这个阿亮的空间。

后续的完善，只有起点，没有终点。
** 【个人介绍】
记录总数：1
*** 2016-07-09
** 【建站记录】
记录总数：1
*** 2016-07-09
上个月27日离职，放松思考了几天。月初开始边学边做，中间继续上着专业数据库设计的短学期，学着驾校。1周完成了1.0的版本.

因为需求只是自己一个人写博客，展示简历和过往经验，也就做的很简单。现在也只是做了显示博文这一个功能.
** 【未来计划】
记录总数：1
*** 2016-07-09
当前只是实现了记录自己学习的博文，接下来会先系统的学习想学习的知识。一个简单的计划如下：
| 任务名称           | 开始时间         | 完成时间         |
|--------------------+------------------+------------------|
| 英语               | <2016-07-10 Sun> | <2016-09-15 Thu> |
|--------------------+------------------+------------------|
| C语言算法/数据结构 | <2016-07-10 Sun> | <2016-09-15 Thu> |
|--------------------+------------------+------------------|
| C#                 | <2016-07-10 Sun> | <2016-09-15 Thu> |
|--------------------+------------------+------------------|
| linux              | <2016-07-10 Sun> | <2016-08-08 Mon> |
|--------------------+------------------+------------------|
| T-SQL              | <2016-08-09 Tue> | <2016-09-15 Thu> |
|--------------------+------------------+------------------|
| html               | <2016-07-10 Sun> | <2016-07-11 Mon> |
|--------------------+------------------+------------------|
| css                | <2016-07-12 Tue> | <2016-07-13 Wed> |
|--------------------+------------------+------------------|
| js                 | <2016-07-14 Thu> | <2016-07-16 Sat> |
|--------------------+------------------+------------------|
| jquery             | <2016-07-17 Sun> | <2016-07-18 Mon> |
|--------------------+------------------+------------------|
| xml-ajax-json      | <2016-07-21 Thu> | <2016-07-25 Mon> |
|--------------------+------------------+------------------|
| ruby on rail       | <2016-07-26 Tue> | <2016-07-31 Sun> |
|--------------------+------------------+------------------|
| winform            | <2016-08-01 Mon> | <2016-08-08 Mon> |
|--------------------+------------------+------------------|
| wpf                | <2016-08-09 Tue> | <2016-08-16 Tue> |
|--------------------+------------------+------------------|
| web service        | <2016-08-17 Wed> | <2016-08-20 Sat> |
|--------------------+------------------+------------------|
| winphone           | <2016-08-21 Sun> | <2016-08-31 Wed> |
|--------------------+------------------+------------------|
| 计算机网络         | <2016-09-01 Thu> | <2016-09-03 Sat> |
|--------------------+------------------+------------------|
| 设计模式了解       | <2016-09-04 Sun> | <2016-09-05 Mon> |
|--------------------+------------------+------------------|
| 框架学习了解       | <2016-09-06 Tue> | <2016-10-07 Fri> |

* 事件记录
** 【版本记录】
记录总数：1
*** V1.0---2016-07-09
** 【架构记录】
记录总数：1
*** A1.0---2016-07-09
** 【其他记录】
暂无其他事件记录。
* 博文目录-按年月
文档总数：24
** 【2016年07月】
*** [[http:www.aliang.space/diary/201607/1.html][关于代码整洁]]
