diary/als-about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>【关于】-阿亮的空间说明文档</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="【关于】-阿亮的空间说明文档"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2016-07-22T23:09+0800"/>
<meta name="author" content="root"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">【关于】-阿亮的空间说明文档</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 INFO</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-1">1 网站说明</a>
<ul>
<li><a href="#sec-1-1">1.1 【初衷】</a></li>
<li><a href="#sec-1-2">1.2 【个人介绍】</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 2016-07-09</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 【建站记录】</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 2016-07-09</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4 【未来计划】</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1 2016-07-09</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 事件记录</a>
<ul>
<li><a href="#sec-2-1">2.1 【版本记录】</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 V1.0&mdash;2016-07-09</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2 【架构记录】</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1 A1.0&mdash;2016-07-09</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3 【其他记录】</a></li>
</ul>
</li>
<li><a href="#sec-3">3 博文目录-按年月</a>
<ul>
<li><a href="#sec-3-1">3.1 【2016年07月】</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1 关于代码整洁</a></li>
<li><a href="#sec-3-1-2">3.1.2 win10快捷键</a></li>
<li><a href="#sec-3-1-3">3.1.3 linux常用命令</a></li>
<li><a href="#sec-3-1-4">3.1.4 linux下安装emacs</a></li>
<li><a href="#sec-3-1-5">3.1.5 linux下配置emacs</a></li>
<li><a href="#sec-3-1-6">3.1.6 emacs常用快捷键</a></li>
<li><a href="#sec-3-1-7">3.1.7 emacs解除read-only时buffer的锁定</a></li>
<li><a href="#sec-3-1-8">3.1.8 emacs的多窗口操作</a></li>
<li><a href="#sec-3-1-9">3.1.9 org常用快捷键</a></li>
<li><a href="#sec-3-1-10">3.1.10 org参考文档</a></li>
<li><a href="#sec-3-1-11">3.1.11 linux下安装texlive2016</a></li>
<li><a href="#sec-3-1-12">3.1.12 解决latex转pdf时不兼容中文</a></li>
<li><a href="#sec-3-1-13">3.1.13 利用github创建个人博客</a></li>
<li><a href="#sec-3-1-14">3.1.14 github添加deploy keys</a></li>
<li><a href="#sec-3-1-15">3.1.15 git常用bash命令</a></li>
<li><a href="#sec-3-1-16">3.1.16 github提交代码到github仓库</a></li>
<li><a href="#sec-3-1-17">3.1.17 删除github上的repository</a></li>
<li><a href="#sec-3-1-18">3.1.18 单独删除github仓库中的某个文件</a></li>
<li><a href="#sec-3-1-19">3.1.19 解决git push时non-fast-forward的问题</a></li>
<li><a href="#sec-3-1-20">3.1.20 github上创建分支</a></li>
<li><a href="#sec-3-1-21">3.1.21 github插件octotree</a></li>
<li><a href="#sec-3-1-22">3.1.22 2016秋招远程查看项目说明</a></li>
<li><a href="#sec-3-1-23">3.1.23 应聘阿里巴巴开放问题1</a></li>
<li><a href="#sec-3-1-24">3.1.24 应聘阿里巴巴开放问题2</a></li>
<li><a href="#sec-3-1-25">3.1.25 应聘阿里巴巴开放问题3</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 博文目录-按标签</a>
<ul>
<li><a href="#sec-4-1">4.1 【笔记】-心灵||信仰（善良&amp;&amp;真诚）</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1 关于代码整洁</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2 【笔记】-应届生面试准备</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1 2016秋招远程查看项目说明</a></li>
<li><a href="#sec-4-2-2">4.2.2 应聘阿里巴巴开放问题1</a></li>
<li><a href="#sec-4-2-3">4.2.3 应聘阿里巴巴开放问题2</a></li>
<li><a href="#sec-4-2-4">4.2.4 应聘阿里巴巴开放问题3</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3 【热爱】-逻辑||思维</a></li>
<li><a href="#sec-4-4">4.4 【热爱】-Linux</a>
<ul>
<li><a href="#sec-4-4-1">4.4.1 linux常用命令</a></li>
<li><a href="#sec-4-4-2">4.4.2 linux下安装emacs</a></li>
<li><a href="#sec-4-4-3">4.4.3 [[http:www.aliang.space/diary/201607/4.html][linux下配置emacs **  【热爱】-Emacs||Github ***  emacs常用快捷键</a></li>
<li><a href="#sec-4-4-4">4.4.4 emacs解除read-only时buffer的锁定</a></li>
<li><a href="#sec-4-4-5">4.4.5 emacs的多窗口操作</a></li>
<li><a href="#sec-4-4-6">4.4.6 org常用快捷键</a></li>
<li><a href="#sec-4-4-7">4.4.7 org参考文档</a></li>
<li><a href="#sec-4-4-8">4.4.8 linux下安装texlive2016</a></li>
<li><a href="#sec-4-4-9">4.4.9 解决latex转pdf时不兼容中文</a></li>
<li><a href="#sec-4-4-10">4.4.10 利用github创建个人博客</a></li>
<li><a href="#sec-4-4-11">4.4.11 github添加deploy keys</a></li>
<li><a href="#sec-4-4-12">4.4.12 git常用bash命令</a></li>
<li><a href="#sec-4-4-13">4.4.13 github提交代码到github仓库</a></li>
<li><a href="#sec-4-4-14">4.4.14 删除github上的repository</a></li>
<li><a href="#sec-4-4-15">4.4.15 单独删除github仓库中的某个文件</a></li>
<li><a href="#sec-4-4-16">4.4.16 解决git push时non-fast-forward的问题</a></li>
<li><a href="#sec-4-4-17">4.4.17 github上创建分支</a></li>
<li><a href="#sec-4-4-18">4.4.18 github插件octotree</a></li>
</ul>
</li>
<li><a href="#sec-4-5">4.5 【必备】-算法||数据结构</a></li>
<li><a href="#sec-4-6">4.6 【技能】-后端：C#</a></li>
<li><a href="#sec-4-7">4.7 【技能】-数据库：Mysql||Sqlserver</a></li>
<li><a href="#sec-4-8">4.8 【技能】-前端：Web</a></li>
<li><a href="#sec-4-9">4.9 【必备】-计算机网络</a></li>
<li><a href="#sec-4-10">4.10 【必备】-操作系统||服务器</a>
<ul>
<li><a href="#sec-4-10-1">4.10.1 win10快捷键</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5">5 感谢</a></li>
<li><a href="#sec-6">6 链接</a></div>
</div>

<div id="outline-container-1" class="outline-4">
<h4 id="sec-1"><span class="section-number-4">1</span> INFO</h4>
<div class="outline-text-4" id="text-1">

<p>日期: 2016-07-09;作者: 阿亮;关键字:网站说明、事件记录、博文目录说明
</p>
<p>
链接:<a href="#als-about.html">说明文档</a>
</p></div>

</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 网站说明</h2>
<div class="outline-text-2" id="text-1">

<p>不想拖延，不想因为想的太多而做的太少而痛苦，一直觉得大多时候忙碌的时候总是让心变简单。
刚刚完成了网站我希望达到的最基本的功能，写个说明文档。开个头，后面不断的补充。
</p>
</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 【初衷】</h3>
<div class="outline-text-3" id="text-1-1">

<p>现在2016-07-09，外面夜很宁静，喜欢这种大城市喧嚣背后这种寂静的心境。
大三结束了，接下来60多天的暑假，然后准备校园招聘会。之前一直忙于2014年11月大二上开始的实习，
做着实习单位所谓的大学生软件服务外包的项目，都是项目需要什么学习什么，学校课上安排什么学习什么。
</p>
<p>
2016年06月27日，正式从待了21个月的实习单位离职。暑假两个月，打算系统的梳理复习一下大学期间打算学到的知识，
最初在CSDN上花一天折腾了一个博客，打算记录学习的知识。后面想着自己还要准备个简历，我觉得青春充满无限幻想，
喜欢折腾，相信明天会更好。结合博客和简历两个需求，便产生了现在这个阿亮的空间。
</p>
<p>
后续的完善，只有起点，没有终点。
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 【个人介绍】</h3>
<div class="outline-text-3" id="text-1-2">

<p>记录总数：1
</p>
</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 2016-07-09</h4>
<div class="outline-text-4" id="text-1-2-1">

</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 【建站记录】</h3>
<div class="outline-text-3" id="text-1-3">

<p>记录总数：1
</p>
</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> 2016-07-09</h4>
<div class="outline-text-4" id="text-1-3-1">

<p>上个月27日离职，放松思考了几天。月初开始边学边做，中间继续上着专业数据库设计的短学期，学着驾校。1周完成了1.0的版本.
</p>
<p>
因为需求只是自己一个人写博客，展示简历和过往经验，也就做的很简单。现在也只是做了显示博文这一个功能.
</p></div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 【未来计划】</h3>
<div class="outline-text-3" id="text-1-4">

<p>记录总数：1
</p>
</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> 2016-07-09</h4>
<div class="outline-text-4" id="text-1-4-1">

<p>当前只是实现了记录自己学习的博文，接下来会先系统的学习想学习的知识。一个简单的计划如下：
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">任务名称</th><th scope="col" class="left">开始时间</th><th scope="col" class="left">完成时间</th></tr>
</thead>
<tbody>
<tr><td class="left">英语</td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-07-10 Sun</span></span></td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-09-15 Thu</span></span></td></tr>
</tbody>
<tbody>
<tr><td class="left">C语言算法/数据结构</td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-07-10 Sun</span></span></td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-09-15 Thu</span></span></td></tr>
</tbody>
<tbody>
<tr><td class="left">C#</td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-07-10 Sun</span></span></td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-09-15 Thu</span></span></td></tr>
</tbody>
<tbody>
<tr><td class="left">linux</td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-07-10 Sun</span></span></td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-08-08 Mon</span></span></td></tr>
</tbody>
<tbody>
<tr><td class="left">T-SQL</td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-08-09 Tue</span></span></td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-09-15 Thu</span></span></td></tr>
</tbody>
<tbody>
<tr><td class="left">html</td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-07-10 Sun</span></span></td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-07-11 Mon</span></span></td></tr>
</tbody>
<tbody>
<tr><td class="left">css</td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-07-12 Tue</span></span></td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-07-13 Wed</span></span></td></tr>
</tbody>
<tbody>
<tr><td class="left">js</td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-07-14 Thu</span></span></td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-07-16 Sat</span></span></td></tr>
</tbody>
<tbody>
<tr><td class="left">jquery</td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-07-17 Sun</span></span></td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-07-18 Mon</span></span></td></tr>
</tbody>
<tbody>
<tr><td class="left">xml-ajax-json</td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-07-21 Thu</span></span></td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-07-25 Mon</span></span></td></tr>
</tbody>
<tbody>
<tr><td class="left">ruby on rail</td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-07-26 Tue</span></span></td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-07-31 Sun</span></span></td></tr>
</tbody>
<tbody>
<tr><td class="left">winform</td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-08-01 Mon</span></span></td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-08-08 Mon</span></span></td></tr>
</tbody>
<tbody>
<tr><td class="left">wpf</td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-08-09 Tue</span></span></td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-08-16 Tue</span></span></td></tr>
</tbody>
<tbody>
<tr><td class="left">web service</td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-08-17 Wed</span></span></td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-08-20 Sat</span></span></td></tr>
</tbody>
<tbody>
<tr><td class="left">winphone</td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-08-21 Sun</span></span></td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-08-31 Wed</span></span></td></tr>
</tbody>
<tbody>
<tr><td class="left">计算机网络</td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-09-01 Thu</span></span></td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-09-03 Sat</span></span></td></tr>
</tbody>
<tbody>
<tr><td class="left">设计模式了解</td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-09-04 Sun</span></span></td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-09-05 Mon</span></span></td></tr>
</tbody>
<tbody>
<tr><td class="left">框架学习了解</td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-09-06 Tue</span></span></td><td class="left"><span class="timestamp-wrapper"> <span class="timestamp">2016-10-07 Fri</span></span></td></tr>
</tbody>
</table>


</div>
</div>
</div>

</div>
